{
  "Sun": {
    "1": "Having the Sun in your 1st House is basically the cosmic equivalent of walking through life with a permanent ring light following you around. You aren't just in the room; you are the room, you are the main event, the headliner, and the director all rolled into one. Because the Sun (your ego) is parked in the House of Self, you radiate a 'Main Character' energy that’s impossible to ignore, even on your sweatpants days, people are going to notice you. You’ve got a natural, high-voltage vitality that makes you a DIY specialist in life; you’d much rather blaze your own trail through the woods than follow a pre-written map. While this makes you a charismatic powerhouse of authenticity and 'what you see is what you get' vibes, the challenge is remembering that other people aren't just extras in your movie. You might accidentally bulldoze over a conversation or take a tiny critique like a personal solar eclipse, but at the end of the day, you’re here to shine bright, lead the pack, and live life at 100% volume.",
    "2": "If your Sun is here, your life is basically a high-stakes game of Monopoly, and you’re playing to win. Your ego is tied directly to what you own, what you earn, and the quality of your snacks. You have a 'Golden Touch' mentality where you want to surround yourself with things that last because fast fashion is an insult to your soul. You’re the person who knows exactly what they’re worth and you’ll charge a premium for it, but watch out for the retail therapy trap. You’re learning that while money is great, your real value is something no one can put a price tag on. Survival Guide: Treat your self-worth like a bank account that never hits zero. When you're feeling low, stop buying things and start listing your non-material talents instead.",
    "3": "With the Sun in the 3rd, your brain is a browser with 47 tabs open and they’re all playing audio. You are the neighborhood narrator, the king or queen of the group chat, and the person who actually reads the trivia cards. Your life force comes from communicating, learning, and staying busy; if you aren't talking, texting, or traveling locally, you're probably bored. You’re witty, fast-paced, and probably know a little bit about everything. Just remember to hit the mute button occasionally so you can actually finish one of those 47 projects! Survival Guide: Carry a notebook everywhere. Your brain moves faster than your hands, and 'brain dumping' your thoughts will prevent a total mental circuit blow.",
    "4": "While everyone else is out chasing clout, you’re busy building an absolute empire behind closed doors. Your Sun is at the very bottom of your chart, meaning your glow is reserved for your inner circle and your home base. You are the CEO of the couch and the protector of the family tree. You find your power in your roots, your history, and your literal real estate. You might be a bit of a homebody, but that’s because your home is your sanctuary. You’re learning that you don’t need a stage to be a star because you just need a solid foundation. Survival Guide: Invest heavily in your 'nest.' A high-quality mattress and a door that locks properly are more important for your mental health than any promotion.",
    "5": "Life is a stage and you’ve got the best lighting package in the business. With the Sun in its favorite house, you are the personification of main character energy. You live for creativity, romance, and pure, unadulterated fun. Whether you’re actually an artist or just the person who throws the best parties, you’re here to express yourself loudly. You have a heart of gold but a flair for the dramatic; if it’s not a vibe, you’re not interested. Just try to remember that every rockstar needs a road crew who feels appreciated too! Survival Guide: Find a creative hobby that is just for you. If you perform for an audience 24/7, you’ll burn out. You need a 'private stage' to stay recharged.",
    "6": "You’re the person who finds a weird amount of joy in a perfectly organized spreadsheet or a completed to-do list. With the Sun in the 6th, you find your light through being useful and keeping the gears of life turning. You’re the ultimate fixer; if there’s a problem, a health hack, or a disorganized pantry, you’re on it. Your ego is tied to your work ethic and your routine. You’re a powerhouse of productivity, but don't let perfectionism become your personality. You’re allowed to have a messy desk once in a while! Survival Guide: Schedule 'unstructured time' into your calendar. If you don't put 'do nothing' on your list, you’ll never do it, and your body will eventually force a reboot.",
    "7": "You’re basically the better half of the zodiac. Your Sun shines brightest when it’s reflected in someone else’s eyes. You are a master of relationships, whether it’s a best friend, a business partner, or a soulmate. You have a gift for balance and diplomacy, and you’re often the person behind the person. However, your challenge is remembering who you are when you’re not half of a pair. You’re learning that you can be a whole sun all on your own, even if you prefer to shine in a partnership. Survival Guide: Practice 'solo dates' once a week. Going to a movie or dinner by yourself helps you remember where you end and the other person begins.",
    "8": "You don’t do small talk. You want the secrets, the deep stuff, and the why behind the what. Having the Sun in the 8th is like being an undercover detective for the human soul. You’re incredibly intense, private, and probably have a don't mess with me aura that’s actually quite magnetic. You find your power through transformation; you’re the phoenix of the zodiac, constantly burning down your old self to level up. You’re deep, mysterious, and a little bit goth at heart, even if you’re wearing pink. Survival Guide: Learn when to let go. You have a tendency to hold onto secrets or grudges like treasure, but sometimes 'burning the map' is the only way to move forward.",
    "9": "Your life is one big Eat Pray Love montage. With the Sun in the 9th, your ego is fueled by expansion; you want more knowledge, more stamps in your passport, and more philosophical debates. You’re the person who asks the big meaning of life questions at 2 AM. You’re a natural teacher and a visionary who can’t stand being bored or boxed in. You’re here to see the big picture, but don’t forget to look down occasionally so you don't trip over the details! Survival Guide: Find a way to share what you learn. Whether it’s a blog or just telling friends stories, your Sun needs an outlet for all that 'big picture' wisdom.",
    "10": "If the 1st House is look at me, the 10th House is look at what I built. You are the ultimate professional, the person with a 10-year plan and the ambition to back it up. Your Sun is at the top of the chart, making you very visible to the public. You find your identity in your career, your reputation, and your legacy. You’re a natural authority figure, but the pressure to be perfect for the public can be exhausting. Remember that you’re a human being and not just a LinkedIn profile! Survival Guide: Keep a 'brag sheet' of your accomplishments, but also keep a 'silly sheet' of things you did just for fun. Don't let your job title eat your soul.",
    "11": "You’re the person who knows everyone and has a foot in every subculture. Your Sun shines brightest when you’re part of a team, a movement, or a weirdly specific Discord server. You are the ultimate friend and a champion for the future. You care about the collective and making the world a bit more progressive. You’re quirky, idealistic, and popular even if you feel like an outsider. You find your power in numbers, proving that the brightest lights are the ones that shine for everyone. Survival Guide: Be picky about your 'squad.' Because you shine so bright in groups, people will try to hitch a ride on your energy. Make sure they’re contributing to the vibe, too.",
    "12": "You’re the behind the scenes wizard. Having the Sun in the 12th is like having a powerful light source hidden behind a velvet curtain. You are deeply intuitive, sensitive, and probably a little bit psychic. You find your power in solitude, spirituality, and your incredibly rich inner world. You might feel a bit invisible or misunderstood by the normal world, but that’s because you’re operating on a different frequency. You’re learning that your greatest strength isn't what you do, but who you are when nobody is watching. Survival Guide: Protect your energy like it’s a rare diamond. You absorb other people's moods like a sponge, so salt baths and 'do not disturb' mode are your best friends."
  },
  "Moon": {
    "1": "With the Moon in your 1st House, you wear your heart on your sleeve and that sleeve is made of high-quality mood-ring fabric. Your emotions are visible from space and your entire vibe can change faster than a trending sound on TikTok. You are incredibly intuitive and reactive, which makes you magnetic but also means you’re essentially an emotional weather station for everyone around you. You don't just feel things, you project them, often making you the person who sets the emotional tone of the room without even saying a word. Survival Guide: Don't make permanent decisions on temporary feelings. Give yourself a 24-hour cooling off period before you react to something big so your logic can catch up to your heart.",
    "2": "You are emotionally attached to your stuff and for you, financial security feels like a warm, weighted blanket. If you’re sad, you’re the type to go on a targeted retail therapy mission for a luxury candle, and if you’re happy, you probably celebrate with a fancy meal. Your sense of comfort is deeply rooted in your physical environment and the stability of your bank account, which makes you a master of creating a cozy, high-value life. Survival Guide: Distinguish between a physical need and an emotional want. Sometimes a walk in the park provides more lasting peace than a new pair of shoes ever could.",
    "3": "You have big feelings about everything and you usually need to talk about them immediately. Your emotions are processed through chatter, journaling, or sending ten-minute voice notes to your best friend while you pace around your room. Your mind and your heart are on a two-way street, so when you’re upset, your thoughts race, and when you’re happy, you’re the most witty person in the group chat. Survival Guide: Not everyone can handle your emotional data dump. Keep a private journal for the raw stuff so you don't accidentally overwhelm your social circle with your inner monologue.",
    "4": "You are the ultimate homebody whose soul is recharged by soft blankets, nostalgic movies, and knowing exactly where your ancestors came from. Your Moon is right at home here, making you the emotional anchor of your family and a person whose private life is their absolute sanctuary. You have a deep, instinctual need for a 'nest' where you can hide from the world and just be yourself without any external pressure. Survival Guide: It is okay to leave the house once in a while. Your sanctuary is great, but getting some fresh air and new scenery helps prevent you from getting stuck in a nostalgia loop or a hermit phase.",
    "5": "You are a romantic at heart and you probably have a crush on at least three fictional characters at any given time. You need to express your feelings through art, play, or a really dramatic Instagram story because if you can't be creative with your emotions, you feel stifled. You are playful, expressive, and you find your emotional safety in the things that bring you pure, unadulterated joy. Survival Guide: Don't let your self-worth depend on the applause of others. Try creating something beautiful just for yourself without posting it for likes or external validation.",
    "6": "You show love by being helpful and for you, a perfectly clean kitchen is basically a spiritual experience. You get emotionally cranky if your routine is messed up or if the vibes at work are even slightly off because you crave order and efficiency to feel safe. You’re the person who remembers everyone's coffee order and makes sure the team is fed, finding your emotional peace through service and self-care. Survival Guide: Schedule unstructured time into your calendar. If you don't put 'do nothing' on your list, you’ll never do it, and your body will eventually force an emotional reboot.",
    "7": "You are the resident Relationship Guru who feels most secure when you have a partner in crime by your side. Your Sun shines brightest when it’s reflected in someone else’s eyes, and you tend to pick up the moods of whoever you’re with like a sponge. You are a master of diplomacy and you find your emotional footing through the mirrors of your closest bonds, whether they are romantic or platonic. Survival Guide: Practice solo dates once a week. Going to a movie or dinner by yourself helps you remember exactly where your feelings end and the other person's begin.",
    "8": "You don't do small talk because you want the deep, dark, soulful truth about everyone you meet. Having the Moon in the 8th is like being an undercover detective for the human heart, making you incredibly intuitive and a little bit mysterious. You keep your own feelings locked in a high-security vault, but you have a magnetic intensity that draws people in to tell you their deepest secrets. Survival Guide: Learn when to let go of emotional baggage. You have a tendency to hold onto old hurts like they are treasures, but sometimes burning the map is the only way to find a new path.",
    "9": "You have a chronic case of wanderlust in your soul and you feel most emotionally satisfied when you’re learning something profound or planning a trip to a place you've never been. Boredom is your emotional enemy, and you need a constant stream of new philosophies, books, and horizons to keep your heart happy. You are a seeker of meaning and you find your comfort in the 'big picture' rather than the boring details of daily life. Survival Guide: Find a way to share what you learn. Whether it’s through a blog or just telling stories, your heart needs an outlet for all that big picture wisdom you gather.",
    "10": "You are the person who wants to be the CEO of the industry or at least the most respected person in the room. You care deeply about your reputation and how the world sees you, often finding your emotional security through your achievements and public standing. You feel most comfortable when you are in charge, being a 'parent' figure to your colleagues, and ensuring that everything is running according to plan. Survival Guide: Keep a brag sheet for your professional wins, but also keep a silly sheet for things you did just for fun. Don't let your job title become your entire identity.",
    "11": "You are the social visionary with a soul who feels emotionally safe when you belong to a group, a movement, or a dedicated community. Your friends are basically your chosen family, and you find your emotional fuel through collective goals and making the world a bit more progressive. You are quirky and idealistic, often acting as the glue that holds your social circle together through thick and thin. Survival Guide: Be picky about your squad. Because you give so much of your emotional energy to the group, make sure the people you surround yourself with are actually contributing to the vibe.",
    "12": "You are an emotional sponge and the 'behind the scenes' wizard of the zodiac. You need massive amounts of hermit time to figure out which feelings are actually yours and which ones belong to the stranger you stood next to in line at the coffee shop. Your inner world is incredibly rich, spiritual, and maybe a little bit psychic, making you a person of deep, quiet strength who operates on a different frequency than most. Survival Guide: Protect your energy like it’s a rare diamond. Use salt baths, meditation, and plenty of do not disturb mode to keep your sensitive soul from getting overwhelmed by the world."
  },
  "Mercury": {
    "1": "With Mercury in your 1st House, you talk with your hands, your face, and your whole body. You’re quick-witted, sharp, and usually the first person to answer a question because your brain is always in fifth gear. People know exactly what you’re thinking because you usually say it immediately, making you a powerhouse of communication and a natural-born storyteller who leads with their mind. Survival Guide: Slow down and listen as much as you speak. Your brain moves so fast that you might skip over important details that others are trying to share with you.",
    "2": "You have a dedicated money mind and you think in terms of value, logic, and whether or not something is truly worth your time. You’re great at practical planning and probably have a secret mental spreadsheet for your dream life and how much it’s going to cost to get there. Your speech is usually deliberate and grounded, and you have a knack for turning abstract ideas into tangible results. Survival Guide: Don't let your thoughts become too rigid. Sometimes the best opportunities are the ones that don't look perfect on paper at first glance.",
    "3": "You are the resident local news station of your social circle whose brain is a supercomputer for trivia, facts, and the latest gossip. You probably have fifteen unread newsletters and you actually plan on reading all of them because your curiosity is bottomless. You’re witty, fast-paced, and you can talk to anyone about anything, making you the ultimate connector in your community. Survival Guide: Carry a notebook everywhere you go. Your brain moves faster than your hands can type, and a brain dump will prevent your mental circuits from blowing out.",
    "4": "You think about the past a lot and your mind is almost always focused on your inner circle and your private world. You’re a quiet thinker who processes information best when you're in your own space, often relying on your intuition and your memories to make sense of the present. You have a gift for understanding people's roots and you speak most comfortably when you are surrounded by the people who know you best. Survival Guide: Don't get stuck in a 'mental basement.' While the past is a great teacher, make sure you're spending enough mental energy on your future goals too.",
    "5": "You have a creative mind and your speech is usually colorful, funny, and maybe a little bit theatrical. You’re the person who tells the best stories at the dinner table and you absolutely love a good pun or a clever bit of wordplay. Your brain is hardwired for fun, romance, and artistic expression, making you a natural at anything that requires a bit of flair and a lot of personality. Survival Guide: Find a creative hobby that is just for you. If you're always 'performing' with your words, you might forget how to just speak your simple truth.",
    "6": "You are the official editor of the zodiac whose brain is hardwired to find the typo, the flaw, or the most efficient way to get things done. You think in bullet points and organized lists, making you the person everyone goes to when they need a project polished or a problem solved. Your mind is a sharp tool that thrives on routine and detail, and you find a weird amount of joy in a perfectly organized plan. Survival Guide: Practice 'mental rest.' If you spend all day analyzing every little detail, you’ll burn out. Give your brain permission to be 'offline' for a few hours every day.",
    "7": "You are a bridge builder who thinks in terms of 'we' and 'us' rather than just 'I' and 'me.' You’re the person everyone comes to for advice because you can always see both sides of an argument and you have a natural gift for diplomacy. Your mind is most active when you are collaborating or debating with someone else, as you find your best ideas through the process of exchange. Survival Guide: Learn to make decisions on your own. It’s great to get a second opinion, but don't let your own voice get drowned out by the search for a consensus.",
    "8": "You have a detective mind and you don't take anything at face value, preferring to dig deep into the psychology and mysteries of life. You’re interested in the things people don't say and you’re a master of the deep dive, whether you’re researching a conspiracy theory or figuring out a friend's secret. Your speech is often intense and focused, and you have a way of getting straight to the heart of any matter without wasting time on fluff. Survival Guide: Know when to stop digging. Sometimes a mystery is just a mystery, and over-analyzing every interaction can lead to unnecessary mental stress.",
    "9": "You have a philosopher mind and you think in big, bold, and global terms that leave no room for boring small talk. You want to discuss the meaning of the universe, religion, and the 'why' behind our existence while everyone else is talking about the weather. You’re a natural teacher and a visionary who can’t stand being mentally boxed in, always looking for the next big idea to explore. Survival Guide: Don't trip over the details. While you’re focused on the big picture, make sure you're still paying enough attention to the practical stuff that keeps life running smoothly.",
    "10": "You have a CEO mind and you speak with an authority that makes people stop and listen whenever you open your mouth. You think carefully about how your words affect your career and your reputation, making you a master of professional communication and public speaking. You’re the person who knows exactly what to say in a high-stakes meeting or a job interview to get the result you want. Survival Guide: Don't let your speech become too 'corporate.' Your authority is great, but people also need to see the human being behind the professional polish.",
    "11": "You have a visionary mind that is always thinking about the future, technology, and how to fix the broken parts of society. You love brainstorming in groups and connecting people with similar ideas, acting as the intellectual glue for your social network or community. Your thoughts are often progressive and a little bit quirky, as you’re never afraid to challenge the status quo with a better idea. Survival Guide: Be picky about who you share your best ideas with. Your brain is an innovation factory, so make sure you're working with people who actually value your vision.",
    "12": "You have a poet mind where your thoughts are more like pictures, symbols, or gut feelings than actual words. You’re deeply intuitive and you might find it hard to explain your 'vibes' to highly logical people, but your instincts are almost always on the money. Your mind is a bridge to the subconscious, making you a creative and spiritual thinker who finds their best ideas in silence and solitude. Survival Guide: Protect your mental space. Because you are so sensitive to the 'noise' of the world, regular meditation and quiet time are non-negotiable for your sanity."
  },

  "Venus": {
    "1": "With Venus in your 1st House, you are basically walking around with a permanent 'beauty filter' on life. You don't just appreciate art; you are the art. You have a natural charm and a physical grace that makes people want to be in your orbit, and you likely put a lot of effort into your personal style because looking good is how you feel powerful. You lead with kindness and a 'pretty' energy that can disarm even the grumpiest person, but the challenge is making sure you aren't just people-pleasing to keep the peace. Survival Guide: Don't let your desire for harmony turn you into a doormat. Your value comes from your soul, not just your ability to make everything look perfect for everyone else.",
    "2": "You are the resident connoisseur of the zodiac, and your love language is definitely 'material girl' or 'material guy.' Having Venus in the 2nd House means you appreciate the finer things—think high-thread-count sheets, gourmet meals, and clothes that feel like a second skin. You show affection through high-quality gifts and physical comfort, and you have a knack for attracting money because you value it so much. Survival Guide: Remember that the best things in life aren't things. While a luxury spa day is great, make sure you aren't trying to fill emotional holes with a credit card swipe.",
    "3": "For you, the ultimate aphrodisiac is a sharp brain and a witty comeback. With Venus in the 3rd, you fall in love with words, voices, and intelligence; you want someone who can text you all day and keep the banter alive. You are a flirtatious communicator who expresses love through poetry, long conversations, and local adventures like exploring a hidden bookstore. Survival Guide: Communication is key, but don't get so caught up in the 'story' of love that you miss the actual reality of it. Make sure there’s depth behind all that charming chatter.",
    "4": "You are the 'Domestic Deity' of the zodiac whose idea of a perfect date is a cozy night in with home-cooked food and deep emotional safety. Venus in the 4th means you invest your beauty and love into your home; you want a sanctuary that looks like a Pinterest board and feels like a hug. You are incredibly loyal and protective of your inner circle, finding beauty in tradition and family roots. Survival Guide: It is okay to let new people into your sanctuary. Don't be so protective of your peace that you miss out on the beautiful chaos that outside social life can bring.",
    "5": "You are the resident Rockstar of Romance, and you treat love like a high-budget theatrical production. With Venus in its favorite house, you live for the butterflies, the grand gestures, and the 'honeymoon phase' that you wish would never end. You are incredibly creative and likely have a hobby or passion project that lets your inner artist shine bright for all to see. Survival Guide: Real love isn't always a movie montage. Learn to appreciate the 'boring' parts of a relationship, because that's where the actual foundation is built between the big performances.",
    "6": "You find beauty in the details and love in the 'boring' stuff, like someone helping you fold laundry or reminding you to take your vitamins. Venus in the 6th means your love language is Acts of Service; you feel most appreciated when things are running smoothly and your partner is actually helpful. You likely have an impeccable eye for health, wellness, and organization, making you the person with the most aesthetic workout gear and a perfectly curated desk. Survival Guide: Stop trying to 'fix' the people you love. Perfectionism is the enemy of intimacy, so learn to love the messy, unpolished parts of life too.",
    "7": "You are the 'Partner of the Century' because your Venus is right at home in the house of relationships. You are in love with the idea of love, and you have a natural talent for making everyone feel seen and heard through your incredible diplomacy. You have an eye for balance and aesthetics, often being the one who keeps the social harmony alive in any group setting. Survival Guide: Don't lose your 'self' in your 'other.' You are so good at compromising that you might forget what you actually want when nobody else is in the room to influence you.",
    "8": "You don't do 'casual' anything; for you, love is a soul-merging, life-altering experience that usually involves a bit of mystery and a lot of intensity. Venus in the 8th means you are drawn to the hidden, the taboo, and the deeply psychological sides of partnership. You want a love that is transformative and 'ride or die,' and you have a magnetic, sultry aura that people find totally addictive. Survival Guide: Vulnerability is your superpower, but trust is your shield. Make sure you're opening up to people who have actually earned the right to see your hidden depths.",
    "9": "Your love language is Adventure, and you’re most likely to fall for someone who can teach you something new or take you to a country you’ve never seen. Venus in the 9th means you find beauty in different cultures, big philosophies, and the thrill of the unknown. You need a partner who is a fellow explorer and won't try to clip your wings or keep you stuck in a boring routine. Survival Guide: Don't keep chasing the 'horizon' so much that you forget to enjoy the beautiful view you have right now. Sometimes the greatest adventure is deep, not just wide.",
    "10": "You are the 'Power Couple' visionary who wants a partner that looks as good on a LinkedIn profile as they do in person. Venus in the 10th means you find beauty in ambition, success, and public reputation; you want to be respected and admired by the world. You likely have a very polished, professional aesthetic and you know exactly how to charm the right people to climb the social or career ladder. Survival Guide: Success is a lonely bedfellow. Make sure you're building a life that feels good on the inside, not just one that looks impressive to your followers and peers.",
    "11": "You are the 'Social Sweetheart' who finds love in the most unexpected places, like a protest, a fan club, or a group chat. Venus in the 11th means your friends are often your lovers (and vice versa), and you value intellectual connection and shared visions above all else. You are quirky, progressive, and probably have a very 'alt' or unique sense of style that defies the mainstream. Survival Guide: Don't treat your romantic partners like just another member of the group. Everyone needs to feel 'special' sometimes, so make sure you're giving your person some exclusive attention.",
    "12": "You are the 'Secret Poet' of the zodiac whose love life often feels like a dream or a hidden mystery. Venus in the 12th means you are incredibly compassionate and romantic, but you often keep your feelings tucked away in a private sanctuary. You find beauty in spirituality, solitude, and the 'unseen' world, and you likely have a very ethereal, soft-focus vibe that makes you seem like you’re from another planet. Survival Guide: Watch out for the 'savior complex.' You have a huge heart for the underdog, but make sure you aren't falling in love with people just because you want to 'heal' them."
  },
  "Mars": {
    "1": "Having Mars in the 1st House is like being born with a permanent 'Go' button and no 'Brake' pedal. You are a powerhouse of pure, raw energy; when you want something, you go after it with the intensity of a heat-seeking missile. You lead with your chin, you’re likely very athletic or physically active, and you have zero fear of confrontation if it means getting the job done. Survival Guide: Not every minor inconvenience is a war. Learn to pick your battles so you don't burn out your 'engine' (or your bridges) before the day is even half over.",
    "2": "You are a 'Hustle Culture' hero who works incredibly hard for the things you want to own. Mars in the 2nd means your drive is tied directly to your bank account and your sense of security; you are the person who will work three jobs if it means you can buy that one specific luxury item you've been eyeing. You are slow to anger, but once you’re mad, you’re as immovable as a mountain. Survival Guide: You are more than your output. Don't let your self-worth be entirely dependent on how much money you’re making or how many things you’ve checked off your shopping list.",
    "3": "Your brain is a weapon and your tongue is a sword. With Mars in the 3rd, you are a fast-talking, quick-thinking debater who loves a good verbal sparring match. You are constantly busy, always on the move, and you get a massive rush from learning new things or winning an argument on the internet. Survival Guide: Words can cut deeper than you realize. Before you hit 'send' on that spicy reply, take a breath and ask if you're trying to be right or if you're trying to be helpful.",
    "4": "You are the 'Protector of the Realm' whose drive is focused entirely on your home and family. Mars in the 4th can make you a bit of a 'keyboard warrior' or someone who is very private about their ambitions, but if someone messes with your house or your people, you turn into a lion. You likely put a lot of energy into home renovations or DIY projects to keep your 'nest' strong. Survival Guide: Watch out for 'simmering' anger at home. If you're feeling frustrated, go for a run instead of picking a fight with the people you live with just to release the pressure.",
    "5": "You are the 'Competitive Creative' who plays as hard as you work. Mars in the 5th means you put a massive amount of energy into your hobbies, your romances, and your self-expression; you don't just 'do' a sport, you win at it. You are passionate, dramatic, and likely have a very high-octane dating life because you love the thrill of the chase. Survival Guide: Not everything is a competition. Sometimes it’s okay to play a game just for fun without needing to be the MVP or the center of attention.",
    "6": "You are the 'Productivity King or Queen' who gets a literal adrenaline rush from a clean inbox and a finished to-do list. Mars in the 6th means you have a massive drive for service, health, and routine; you’re the person who is at the gym at 5 AM and at your desk by 8 AM. You are incredibly precise and you get frustrated when things are inefficient or lazy. Survival Guide: Your body isn't a machine. If you don't schedule rest, your Mars energy will turn into 'burnout' or 'stress-induced' sickness, so learn to chill as hard as you work.",
    "7": "You are the 'Social Gladiator' who fights for justice and balance in your relationships. Mars in the 7th means you are drawn to strong, active partners, but you might find yourself in a lot of 'power struggles' because you’re constantly trying to negotiate the terms of the bond. You put a lot of energy into other people, making you a master of collaboration—as long as you’re not fighting. Survival Guide: Conflict isn't always bad, but it shouldn't be your only way of connecting. Try to find ways to team up against a problem rather than teaming up against each other.",
    "8": "You are the 'Detective of the Dark Side' with an intensity that can be felt the moment you walk into a room. Mars in the 8th means your drive is psychological, sexual, and transformative; you want to get to the bottom of everything and you aren't afraid of the 'scary' parts of life. You are incredibly resourceful and you excel in high-pressure situations that would make anyone else fold. Survival Guide: Don't become obsessed with power or control. Trust is the hardest thing for you to give, but it’s the only way to turn that 'warrior' energy into 'healer' energy.",
    "9": "You are the 'Spiritual Explorer' who will fight to the death for your beliefs and your freedom. Mars in the 9th means your energy is focused on expansion; you want to travel, learn, and conquer new intellectual territories. You have a lot of 'crusader' energy and you likely get fired up about politics, religion, or philosophy, always looking for the next 'big truth' to conquer. Survival Guide: Everyone is allowed to have their own truth. You don't need to convert the whole world to your way of thinking to be a successful explorer of your own life.",
    "10": "You are the 'Ambitious Architect' who is playing a very long game for world domination—or at least a corner office. Mars in the 10th is a powerhouse placement for career drive; you are disciplined, authoritative, and you will outwork everyone else to get to the top. You find your identity in your achievements and you have a natural talent for leading others and getting things done on a grand scale. Survival Guide: The view at the top is great, but don't forget the people you stepped on to get there. Build a legacy based on respect rather than just raw power.",
    "11": "You are the 'Revolutionary' whose drive is focused on the group, the team, or the future of humanity. Mars in the 11th means you are a powerhouse in community organizing or group projects; you get your energy from being part of a collective 'fight' for a better world. You are quirky, independent, and likely the person who pushes your friend group to try new, weird, and exciting things. Survival Guide: Don't get so caught up in 'the cause' that you forget your individual friends. Sometimes one-on-one connection is more important than a group victory.",
    "12": "You are the 'Shadow Warrior' whose greatest battles are fought inside your own head or behind closed doors. Mars in the 12th means your energy is often hidden, making you someone who works best in solitude or on spiritual projects where you don't have to be 'on' for the world. You have a massive amount of psychic drive and you likely find your strength through meditation, art, or helping others in secret. Survival Guide: Watch out for 'repressed' anger. If you don't find a healthy way to express your drive, it will turn into passive-aggression or self-sabotage, so find a private outlet for your fire."
  },

  "Jupiter": {
    "1": "Having Jupiter in the 1st House is like being born under a lucky star that never sets. Your personality is massive and your optimism is practically a superpower that draws opportunities toward you just because you exist. You find your greatest luck simply by being your most authentic, expansive self and taking up space; the world literally opens doors for you when you project confidence and a positive attitude. However, your blessing is also your challenge, as you might struggle with over-indulgence or an ego that grows a little too large for the room. Survival Guide: Your luck is tied to your generosity, so keep sharing the wealth and the good vibes to keep the cosmic faucet running. Luck is found in new beginnings and personal branding.",
    "2": "Jupiter in the 2nd House is the 'Golden Pocket' placement where abundance flows through your bank account and your self-worth. You have a natural knack for attracting wealth and resources, and you likely find that whenever you are truly in a pinch, money shows up from an unexpected source. You find your luck in high-value investments, luxury goods, and anything that builds your physical security, often being blessed with a 'Midas touch' in business. Survival Guide: Don't let your appetite for 'more' lead to massive debt or hoarding. True abundance is a flow, not a stagnant pool, so use your wealth to create more value in the world. Luck is found in banking, property, and developing your natural talents.",
    "3": "With Jupiter in the 3rd House, your mind is a treasure chest and your words are worth their weight in gold. You are blessed with an incredible intelligence, a quick wit, and a gift for communication that makes people hang on your every word. You find your luck through writing, teaching, podcasting, or even just being the person who 'knows a guy' for everything. Your local community and your siblings are often sources of major opportunities and unexpected breaks. Survival Guide: Your brain is a supercomputer, but don't let it get cluttered with useless trivia. Focus your curiosity on things that actually expand your world. Luck is found in short trips, siblings, writing projects, and neighborhood networking.",
    "4": "Jupiter in the 4th House means your 'pot of gold' is buried right under your living room floor. You are blessed with a supportive family or a deep sense of inner peace that acts as a safety net throughout your life. You find your luck through real estate, land, and creating a home that feels like a palace, often inheriting good fortune or 'emotional wealth' from your ancestors. Your home life is where you experience your biggest growth and your most profound sense of joy. Survival Guide: Don't become so comfortable in your 'castle' that you forget to explore the world outside. Use your stable base to launch your biggest dreams. Luck is found in home renovations, real estate, and ancestral healing.",
    "5": "You are the resident 'Favorite of the Gods' when it comes to creativity, romance, and pure fun. Jupiter in the 5th House means you find your luck through taking risks, whether that's in a creative project, a hobby, or even a literal gamble. You are blessed with a vibrant creative spark and likely have a 'magical' relationship with children or younger people who bring abundance into your life. Your love life is often larger than life, filled with grand gestures and epic stories. Survival Guide: Don't let your love for the 'win' turn you into a reckless risk-taker. Balance your play with a little bit of grounded reality so the fun doesn't stop. Luck is found in artistic expression, romance, and speculative ventures.",
    "6": "Jupiter in the 6th House makes you the person who always lands on their feet at work and stays weirdly healthy even when everyone else has the flu. You find your luck through service, daily routines, and a job that allows you to help others or improve the world. You are blessed with a productive spirit and often find that the 'right' job or the perfect health solution appears exactly when you need it. Your coworkers or employees are often the ones who bring you the biggest opportunities for expansion. Survival Guide: Watch out for 'over-extending' your help. You can't fix everyone, and doing too much for others can lead to burnout despite your high vitality. Luck is found in wellness habits, pets, and being the most helpful person in the room.",
    "7": "Jupiter in the 7th House is the 'Soulmate' placement where your luck is tied directly to the people you partner with. You find your biggest blessings through marriage, business partnerships, and legal matters, often 'marrying up' or finding a partner who expands your world in every way. You are blessed with a natural charm that makes people want to collaborate with you, and your enemies often end up becoming your greatest teachers or even your friends. Survival Guide: Don't rely so much on others that you forget how to stand on your own. A partnership should be an addition to your life, not your entire identity. Luck is found in contracts, counseling, and high-level collaborations.",
    "8": "Jupiter in the 8th House is like having a cosmic 'Get Out of Jail Free' card for life’s most intense moments. You find your luck through deep transformation, other people's money, inheritances, or shared resources. You are blessed with a powerful intuition and a knack for navigating crises that would break anyone else, often coming out of a 'taboo' or difficult situation even better than you went in. Your growth comes through intimacy and the psychological deep-dives that most people are afraid to take. Survival Guide: Don't get addicted to the 'drama' of transformation. Peace is just as valuable as power, so learn to enjoy the quiet moments too. Luck is found in taxes, intimacy, research, and inheritances.",
    "9": "Jupiter is at home in the 9th House, making you the ultimate 'Eternal Student' of the universe. You find your luck through long-distance travel, higher education, and exploring foreign cultures or spiritual philosophies. You are blessed with a 'big picture' vision that allows you to see the truth before anyone else does, and you often find that luck follows you whenever you step out of your comfort zone and into the unknown. Your teachers, mentors, and journeys are the keys to your abundance. Survival Guide: Don't become a 'know-it-all' who is too focused on the horizon to see the person standing right in front of you. Stay humble in your wisdom. Luck is found in publishing, university, international travel, and philosophy.",
    "10": "Jupiter in the 10th House is the 'CEO' placement where your luck shines in the public eye and your career. You are blessed with a stellar reputation and a natural authority that makes people want to promote you or put you in charge. You find your luck through professional achievements, public status, and your relationship with authority figures, often reaching the 'top of the mountain' with much less effort than others. Your legacy is one of expansion and leadership, making you a highly visible success story. Survival Guide: With great power comes great responsibility. Use your platform to lift others up rather than just decorating your own office. Luck is found in career promotions, public awards, and leadership roles.",
    "11": "Jupiter in the 11th House means your luck is found in the 'Power of the People.' You are blessed with a massive social network and friends who are willing to go to bat for you at a moment's notice. You find your abundance through group activities, humanitarian causes, and networking, often seeing your biggest dreams come true through a 'friend of a friend.' Your ability to envision a better future is what draws luck toward you, as people are naturally inspired by your progressive ideals. Survival Guide: Don't let your 'social life' distract you from your individual purpose. Quality of friends is always more important than the quantity of followers. Luck is found in community organizing, tech, and big group projects.",
    "12": "Having Jupiter in the 12th House is like having a 'Guardian Angel' on 24/7 standby. You find your luck in solitude, spirituality, and behind-the-scenes work where nobody is watching. You are blessed with a deep, internal sense of protection and often find that you are 'saved' from disaster at the very last second by a stroke of pure, unseen providence. Your greatest growth comes through meditation, charity, and exploring the subconscious world, making you a 'healer' for others who are struggling in the dark. Survival Guide: Don't use your 'inner world' as an escape from reality. Your spiritual gifts are meant to be brought back into the world to help others. Luck is found in dreams, retreat, charity work, and subconscious healing."
  },
  "Saturn": {
    "1": "With Saturn in the 1st House, life has likely felt like an uphill battle since the day you were born. You are disciplined by your own identity and appearance; you might experience loss through a lack of self-confidence or a childhood that forced you to grow up way too fast. This is where you are tested to build a 'backbone' of steel, and while you may struggle with feeling 'not good enough,' your lesson is to become your own authority. Survival Guide: You are a late bloomer, and your greatest power comes in your 30s and beyond. Stop being so hard on yourself; you are building a masterpiece, and that takes time. Discipline is found in self-mastery and personal boundaries.",
    "2": "Saturn in the 2nd House is the 'Cosmic Accountant' who demands that you earn every single penny through hard work and discipline. You may experience loss through financial setbacks, poverty consciousness, or a constant fear of 'not having enough' that makes you stingy with yourself. This placement disciplines you to value what you have and to build wealth slowly and sustainably rather than through luck. Survival Guide: Your worth is not your bank account. Learn to invest in yourself with the same discipline you use to save money, and the security will eventually follow. Discipline is found in budgeting, delayed gratification, and financial planning.",
    "3": "With Saturn in the 3rd House, your mind is a heavy-duty engine that requires a lot of 'maintenance.' You may experience loss through communication breakdowns, difficulties in early education, or a strained relationship with siblings that leaves you feeling isolated. You are disciplined through your words and your thoughts; you might be terrified of saying the wrong thing, leading to a 'serious' or quiet personality. Survival Guide: Your brain is built for deep, complex work, not light chatter. Practice 'speaking your truth' even if your voice shakes, because your words have weight. Discipline is found in serious study, writing, and logical thinking.",
    "4": "Saturn in the 4th House brings the 'Weight of the World' to your doorstep and your family life. You may experience loss through a distant or strict parent, a difficult home environment, or the literal loss of a home or 'roots' at a critical time. You are disciplined by your domestic responsibilities and your past, often feeling like you have to carry the emotional burden for your entire family tree. Survival Guide: You are not responsible for your ancestors' mistakes. Build your own 'home' from scratch based on your own rules, not the ones you were forced to follow as a kid. Discipline is found in real estate, family duties, and emotional resilience.",
    "5": "Saturn in the 5th House is like a 'No Fun' sign that you’ve spent your life trying to ignore. You may experience loss through creative blocks, romantic rejections, or difficulties with children that feel like personal failures. You are disciplined by your need for joy; you might feel 'guilty' for having fun or find that your creative projects take years of grueling work to get noticed. Survival Guide: Creativity is a discipline, not just a vibe. Once you commit to your craft with the seriousness of a job, you will find that your 'play' becomes world-class. Discipline is found in artistic technique, parenthood, and structured fun.",
    "6": "Saturn in the 6th House is the 'Taskmaster' of the zodiac who demands absolute perfection in your work and your body. You may lose your job in a critical time or experience chronic health problems that force you to change your entire lifestyle. You are disciplined by your routine and your service to others; if you get lazy or disorganized, Saturn will quickly 'correct' you with a reality check. Survival Guide: Stop being a perfectionist. Your value isn't based on how many hours you work, so learn to rest before your body makes you. Discipline is found in wellness routines, work ethic, and attention to detail.",
    "7": "Saturn in the 7th House makes your relationships feel like a high-stakes legal contract. You may experience loss through a painful divorce, a long-term 'lonely' period, or a partner who is cold, strict, or much older. You are disciplined by your bonds with others; you might feel like you’re the only one putting in the work, but your lesson is to find out what a 'real' partnership looks like beyond the fairy tale. Survival Guide: Quality over quantity is your mantra. You are better off alone than in a bad partnership, so wait for the person who is as committed as you are. Discipline is found in commitment, boundaries, and legal contracts.",
    "8": "Saturn in the 8th House is the ultimate test of your psychological and financial resilience. You may experience loss through a messy inheritance, 'other people's debt,' or a deep emotional crisis that feels like a spiritual death. You are disciplined by intimacy and shared power; you might be terrified of losing control or being vulnerable, leading to a very guarded and intense personality. Survival Guide: You are a 'survivor' in the truest sense of the word. Use your discipline to master your own shadows and you will become an immovable force of nature. Discipline is found in debt management, psychology, and shared investments.",
    "9": "Saturn in the 9th House is the 'Grumpy Professor' who makes you earn your wisdom the hard way. You may experience loss through the breakdown of your belief systems, difficulties with higher education, or travel plans that go spectacularly wrong at the worst time. You are disciplined by your worldview and your search for 'truth'; you might feel like life is meaningless until you build a philosophy that can actually withstand a storm. Survival Guide: Don't become dogmatic or cynical. Keep an open mind while you build your 'map' of the universe, and remember that wisdom is a lifelong marathon, not a sprint. Discipline is found in teaching, university, and long-term travel.",
    "10": "Saturn is at home in the 10th House, but that doesn't make it easy; it just makes it 'heavy.' You may experience loss through a public 'fall from grace,' a career that stalls right when you think you’re winning, or a crushing pressure to live up to a reputation. You are disciplined by your ambition and your status; you likely feel like the world is watching you and judging your every move, forcing you to be 'perfect' at all times. Survival Guide: Success that comes early is usually a trap. Your greatest achievements will come later in life once you’ve proven you can handle the weight of the crown. Discipline is found in leadership, reputation, and long-term career goals.",
    "11": "Saturn in the 11th House is the 'Filter' that keeps your social circle small and your dreams realistic. You may experience loss through the betrayal of friends, being 'cast out' of a group, or seeing a long-held vision crumble because it wasn't built on a solid foundation. You are disciplined by your social networks and your ideals; you might feel like an 'outsider' who never quite fits in, but your lesson is to find your own 'tribe' based on shared work and values. Survival Guide: You don't need a thousand followers; you need three people who will show up for you at 3 AM. Invest in your 'real' community. Discipline is found in networking, social causes, and team management.",
    "12": "Saturn in the 12th House is the 'Silent Prison' of the zodiac where your discipline happens in the dark. You may experience loss through 'hidden enemies,' periods of isolation, or mental health struggles that feel like a heavy fog you can't escape. You are disciplined by your subconscious and your spiritual life; you might feel a deep, unexplained 'guilt' or a fear of the unknown that keeps you tucked away from the world. Survival Guide: Your 'shadow' is only scary because you aren't looking at it. Use meditation and therapy to shine a light on your fears, and your 'prison' will become a sanctuary of strength. Discipline is found in solitude, meditation, and spiritual practice."
  },
  "Uranus": {
    "1": "Having Uranus in the 1st House is like being plugged into a 220-volt outlet from the moment you’re born. You are the resident 'Glitch in the Matrix' whose sense of self and personal style is naturally innovative, rebellious, and totally unpredictable. You likely find luck and power when you lean into your 'weirdness' rather than trying to fit in, as your sudden changes in appearance or attitude are exactly what keeps you ahead of the curve. Survival Guide: Don't be afraid to change your entire life on a whim if it feels authentic. Your brand is 'The Disruptor,' so embrace the shocks you give to others as a sign that you're doing it right. Innovation is found in your physical presence and individual identity.",
    "2": "In the 2nd House, Uranus treats your bank account like a roller coaster. You may experience sudden windfalls followed by unexpected financial 'surprises' that force you to rethink what you value. This placement is a lesson in detachment; you are being pushed to find innovative ways to make money, perhaps through tech, freelance work, or something totally 'out there.' Survival Guide: Your security comes from your ability to adapt, not from a fixed number in a bank account. Stay flexible and keep an 'emergency fund' for the next lightning strike. Innovation is found in digital currency, alternative income streams, and resource management.",
    "3": "Uranus in the 3rd House makes your brain a high-speed processor that is constantly picking up signals from the future. You are prone to sudden 'Aha!' moments and flashes of genius, but you might also struggle with a scattered focus or a feeling that your mind is moving too fast for your mouth. You find luck through disruptive communication, perhaps by writing something that shocks people or by using technology to bridge gaps in your community. Survival Guide: Your mind is a lightning rod. Carry a recording device or a notes app because your best ideas will vanish as quickly as they appeared. Innovation is found in media, local networking, and radical new ways of thinking.",
    "4": "With Uranus in the 4th House, your 'roots' are likely planted in an earthquake zone. Your home life or family history may have been unconventional or filled with sudden disruptions that made it hard to feel 'settled.' You find your power by creating a living situation that is totally unique to you, perhaps a 'smart home' or a nomadic lifestyle that allows you to move whenever the mood strikes. Survival Guide: Don't try to force a 'white picket fence' life if your soul wants a van in the desert. Your home is where the revolution starts. Innovation is found in real estate, family dynamics, and domestic technology.",
    "5": "You are the 'Mad Scientist' of creativity and romance. Uranus in the 5th House means your love life is a series of sudden 'plot twists' and your creative projects are likely to be experimental or avant-garde. You find luck when you take the 'weird' risk rather than the safe one, and your relationship with children or hobbies is often characterized by a need for total freedom and originality. Survival Guide: Don't let the need for 'shock value' ruin a good thing. Innovation is great, but make sure your heart is actually in the game before you flip the board. Innovation is found in art, dating apps, and speculative creativity.",
    "6": "Uranus in the 6th House means you are the person who will literally 'break' the office if you’re forced to work a 9-to-5 desk job. You need an innovative, flexible routine that allows for sudden bursts of energy followed by total detachment. You may experience 'surprise' health issues that force you to look into alternative or high-tech wellness solutions, as your body is essentially a sensitive electric circuit. Survival Guide: Your work ethic is brilliant but erratic. Find a career that prizes 'results' over 'hours' so you don't burn out your nervous system. Innovation is found in bio-hacking, freelance work, and workplace efficiency.",
    "7": "In the 7th House, Uranus brings the lightning to your 'one-on-one' relationships. You may attract partners who are eccentric, geniuses, or totally unreliable, and your relationships often start or end with a sudden 'boom.' You are being pushed to innovate the way you relate to others, perhaps through non-traditional partnerships or by maintaining a high degree of independence within a commitment. Survival Guide: Don't mistake 'instability' for 'excitement.' Look for a partner who gives you space to be free without making you feel like you're standing on sinking sand. Innovation is found in legal partnerships, counseling, and modern romance.",
    "8": "Uranus in the 8th House is the 'Shock to the System' placement for your shared resources and intimacy. You may experience sudden shifts in inheritances, taxes, or your partner's income that force you to become resourceful overnight. This is also where you experience 'psychological lightning,' with sudden breakthroughs in therapy or occult studies that completely change your understanding of power and death. Survival Guide: Stay detached from 'other people's money.' Your power comes from your ability to survive the unexpected and rebuild from scratch. Innovation is found in joint ventures, research, and psychological transformation.",
    "9": "You have the mind of a 'Space Traveler' when it comes to philosophy and education. Uranus in the 9th House means your beliefs can change in a heartbeat based on a new piece of information or a sudden 'vision' during a trip. You are likely drawn to radical new religions, fringe sciences, or international adventures that shock your system into a higher state of awareness. Survival Guide: Don't be a 'contrarian' just for the sake of it. Make sure your radical beliefs are actually grounded in some form of truth. Innovation is found in publishing, higher learning, and global travel.",
    "10": "Uranus in the 10th House is the 'Career Rebel' placement. You are likely to change your profession several times or find success in a field that didn't even exist twenty years ago. You find your power when you are seen as a visionary or a disruptor in your industry, but you may struggle with authority figures who want you to 'follow the rules.' Survival Guide: Your reputation is built on being 'The Future.' Don't settle for a boring title when you were born to be an iconoclast. Innovation is found in leadership, public image, and professional technology.",
    "11": "Uranus is at home in the 11th House, making you the ultimate 'Networker of the Future.' You find luck and surprise opportunities through weird online communities, tech-savvy friend groups, and humanitarian movements that are decades ahead of their time. You are the one who introduces your friends to the 'next big thing' before anyone else has even heard of it. Survival Guide: Don't get so caught up in the 'digital' world that you forget the people right in front of you. Use your tech-vision to build real-world connections. Innovation is found in social media, group goals, and scientific breakthroughs.",
    "12": "With Uranus in the 12th House, your 'shocks' happen in the dark. You are likely to have sudden psychic flashes, prophetic dreams, or 'bursts' of creative genius while you are alone or asleep. This is where you innovate your subconscious, breaking old karmic patterns with a sudden 'strike' of spiritual insight that frees you from a mental prison you didn't even know you were in. Survival Guide: Pay attention to your 'random' thoughts. They aren't random; they are signals from your higher self trying to bypass your ego. Innovation is found in meditation, dream work, and subconscious healing."
  },
  "Neptune": {
    "1": "Having Neptune in the 1st House is like living with a permanent 'soft-focus' lens on your life. You are incredibly magnetic and ethereal, but you often struggle to see yourself clearly or to set firm boundaries with others. People project their own fantasies onto you, making you a 'chameleon' who can be whoever everyone else wants you to be. Survival Guide: Don't get caught up in the dream of who you *should* be. Practice looking in the mirror and grounding yourself in reality so you don't disappear into a cloud of your own mystery.",
    "2": "Neptune in the 2nd House can make your finances feel like a disappearing act. You may find luck through art, spirituality, or creative ventures, but you are also prone to 'fantasizing' about money rather than managing it. You might experience loss through scams or simply 'forgetting' to deal with reality. Survival Guide: Hire a grounded accountant and stop using 'vibes' to balance your checkbook. Your value is high, but your math needs to be real. Luck is found in artistic assets and spiritual abundance.",
    "3": "With Neptune in the 3rd House, your mind is a poet's playground. You are blessed with an incredible imagination and a psychic-like way of communicating, but you might struggle with 'brain fog' or a tendency to see the 'story' rather than the facts. You find your luck through songwriting, fiction, or helping others find their voice. Survival Guide: Double-check the details. You are prone to miscommunications because you assume everyone is on your same 'wavelength.' Stay grounded in the literal.",
    "4": "Neptune in the 4th House makes your 'home' feel like a sanctuary or a dreamscape. You may have a family history that is shrouded in mystery or a sense of 'longing' for a home that doesn't actually exist. You find your peace in a space that is filled with music, art, and soft energy. Survival Guide: Don't project your 'perfect family' fantasies onto your actual relatives. Accept your roots as they are, flaws and all, so you don't stay lost in nostalgia. Peace is found in domestic spirituality.",
    "5": "You are the resident 'Dreamer of Romance.' Neptune in the 5th House means you are in love with the *idea* of love, and you often find your greatest creative inspiration through 'fantasies' and artistic escapes. You might fall for someone who is 'unavailable' or 'broken' because you're projecting a savior fantasy onto them. Survival Guide: Your creativity is a gift, but don't let your dating life become a drama series. Keep your 'muses' and your 'partners' in separate categories. Luck is found in theater, film, and pure imagination.",
    "6": "In the 6th House, Neptune can make your daily routine feel like a confusing haze. You may have sensitive health that 'doctors can't explain' or a job that feels like a spiritual mission rather than a paycheck. You find your luck through holistic healing, service to others, and jobs that involve creativity or sacrifice. Survival Guide: Don't 'drift' through your work life. Set alarms, make lists, and stay grounded in your body, or you'll find yourself perpetually exhausted by the 'vibes.' Wellness is found in spiritual routines.",
    "7": "Neptune in the 7th House is the 'Rose-Colored Glasses' placement for relationships. You have a massive tendency to fall in love with fantasies or 'potential' instead of the real person standing in front of you. You might project your own ideals onto a partner, making them a god in your eyes until the 'fog' lifts and reality hits. Survival Guide: Stop trying to 'save' people or 'change' them to fit your dream. Ask your friends for a reality check on your partners before you dive in too deep. Luck is found in soulful connections and artistic collaboration.",
    "8": "With Neptune in the 8th House, your intimacy and shared finances are a deep, misty ocean. You may experience 'mysterious' losses or gains through inheritances or taxes, and your sex life is often a search for a 'spiritual union' rather than just physical pleasure. You are incredibly psychic about other people's secrets. Survival Guide: Be extremely careful with shared money. Clear, written contracts are your only defense against the 'fog' of financial misunderstandings. Transformation is found in shadow work and spiritual healing.",
    "9": "Neptune in the 9th House makes you a 'Spiritual Wanderer.' You are drawn to mystical religions, ancient philosophies, and the idea of 'escaping' to a foreign land to find yourself. You may get caught up in 'gurus' or spiritual fantasies that promise all the answers. Survival Guide: Wisdom is a path, not a destination. Don't let your search for 'the meaning of life' prevent you from living the life you actually have. Luck is found in pilgrimages, teaching spirituality, and vision quests.",
    "10": "In the 10th House, Neptune makes your career and public image feel like a 'glamour' spell. You may find fame or success in film, music, or healing, as people see you as a symbol of something bigger than yourself. However, you might also struggle to find a 'real' career path because nothing ever lives up to your grand vision. Survival Guide: Your reputation is fragile because it's built on 'perception.' Be authentic so the world's fantasy of you doesn't turn into a scandal. Luck is found in the arts and humanitarian leadership.",
    "11": "Neptune in the 11th House means your social circle is a collection of dreamers, artists, and maybe a few 'lost souls.' You find your luck through group activities that have a spiritual or creative goal, but you may also be taken advantage of by 'friends' who drain your energy or money. Survival Guide: Don't project your 'ideal world' fantasies onto groups that haven't earned your trust. Set firm boundaries in your social life. Innovation is found in collective meditation and humanitarian art.",
    "12": "Neptune is at home in the 12th House, making you a 'Psychic Sponge' of the highest order. You have a direct line to the collective unconscious and your dreams are likely vivid, prophetic, and filled with artistic symbols. You find your greatest power in solitude and meditation, but you can also lose yourself in 'escapism' like movies, sleep, or other substances. Survival Guide: Your 'inner world' is your greatest asset, but don't let it become your only world. Stay connected to reality through regular grounding practices. Luck is found in spiritual retreat and artistic solitude."
  },
  "Pluto": {
    "1": "Having Pluto in the 1st House is like carrying a nuclear reactor in your personality. You are a person of serious power plays and intense personal magnetism; people either love you or are intimidated by you from the first glance. You may have experienced being 'powerless' in your early life, which forced you to develop an iron will and the ability to totally shed your skin and reinvent yourself. Survival Guide: Your power is meant to be 'healed,' not just 'held.' Stop trying to control how others see you and trust that your natural intensity is your greatest strength. Transformation is found in self-mastery and radical rebirth.",
    "2": "Pluto in the 2nd House turns your relationship with money into a high-stakes 'battle for control.' You may experience total financial 'destruction' only to rebuild an empire from the ashes, learning that your true worth isn't in your bank account but in your survival skills. You find your power by shedding your attachment to 'stuff' and mastering the energy of wealth. Survival Guide: Don't let your 'fear of poverty' turn you into a power-hungry hoarder. True wealth is the ability to transform your resources at will. Transformation is found in banking, high-level business, and developing deep inner values.",
    "3": "In the 3rd House, Pluto makes your words a 'force of nature.' You may have felt powerless or silenced in your early education or by siblings, leading you to develop a mind that is an investigative weapon. You don't just 'talk'; you excavate the truth, making you a master of psychology and persuasion who can change someone's entire worldview with a single conversation. Survival Guide: Don't use your intelligence to 'bulldoze' others into submission. Use your depth to speak for those who have no voice. Transformation is found in research, journalism, and deep psychological study.",
    "4": "Pluto in the 4th House is the 'Shadow in the Basement.' You likely come from a family with deep secrets, power struggles, or a history of 'destruction and rebirth' that forced you to become the emotional detective of the family tree. You find your power by shedding the trauma of your ancestors and building a home that is a true fortress of psychological strength. Survival Guide: You cannot control your past, but you can control how it 'rules' you. Dig up the secrets, face the ghosts, and then let them go. Transformation is found in real estate, genealogy, and deep inner healing.",
    "5": "You are the 'Intense Artist' who treats romance and creativity like a life-or-death mission. Pluto in the 5th House means your love affairs are often 'transformative' (read: messy and soul-altering), and your creative projects are meant to shock or heal. You may feel powerless in your search for joy until you learn to shed the need for 'obsession' in your fun. Survival Guide: Romance shouldn't be a power play. Learn to enjoy the 'light' parts of life so you don't burn yourself out on your own intensity. Transformation is found in master-level art, deep romance, and raising powerful children.",
    "6": "In the 6th House, Pluto turns your workplace and your body into a 'proving ground.' You may experience being 'powerless' under a tyrannical boss or a chronic health crisis that forces you to totally shed your old habits. You find your power when you master your routine and use your work as a tool for deep, systemic transformation or healing. Survival Guide: Your body is a temple, not a battlefield. Stop pushing yourself to the point of destruction and learn to work 'with' your energy rather than against it. Transformation is found in holistic medicine, deep-level service, and workplace reform.",
    "7": "Pluto in the 7th House makes your relationships a 'Mirror of Power.' You attract partners who are intense, controlling, or transformative, often feeling 'powerless' in their presence until you learn to reclaim your own authority. Your bonds are where you go to 'die and be reborn,' shedding old versions of yourself through the fire of intimacy. Survival Guide: Stop entering 'power struggles' with the people you love. A relationship is a shared throne, not a contest for who wears the crown. Transformation is found in deep counseling, legal battles, and soulmate connections.",
    "8": "Pluto is at home in the 8th House, making you the 'High Priest/ess' of transformation. You may experience serious power plays regarding inheritances, taxes, or shared resources, often learning the hard way about who you can truly trust. You find your greatest power by shedding your fear of death and the unknown, becoming a master of the 'unseen' world and psychological depth. Survival Guide: With great power comes the need for great ethics. Don't use your 'psychic' insights to manipulate others; use them to heal the world's deepest wounds. Transformation is found in intimacy, research, and financial mastery.",
    "9": "In the 9th House, Pluto makes your beliefs a 'Sacred War.' You may have felt 'powerless' under a strict religious upbringing or a dogma that you eventually had to destroy and rebuild. You find your power through higher education, travel, and a philosophy that is based on the 'deep truth' rather than surface-level 'fantasies.' Survival Guide: Everyone is on their own journey. You don't need to 'destroy' other people's beliefs to validate your own. Stay humble in your wisdom. Transformation is found in publishing, university teaching, and international travel.",
    "10": "Pluto in the 10th House is the 'Power Move' placement. You find your identity in career and public status, but you likely have to go through a 'public destruction' or a massive career shift before you reach your true potential. You are seen as a powerful, authoritative figure, but you may struggle with 'hidden enemies' or authority figures who feel threatened by your intensity. Survival Guide: Don't let the pursuit of 'power' destroy your soul. Build a legacy that is based on real change, not just a fancy title. Transformation is found in leadership, public reform, and high-stakes careers.",
    "11": "Pluto in the 11th House means you may feel 'powerless' in large groups, communities, or your friend circle until you learn to find your own voice. Your friendships are often intense and 'all-or-nothing,' and you likely find your power by leading a movement or a group that is dedicated to radical social change. Survival Guide: Be careful who you 'team up' with. Groups can have a 'hive mind' of power that can swallow you whole if you aren't grounded in your own truth. Transformation is found in social networking, tech innovation, and group goals.",
    "12": "With Pluto in the 12th House, your 'power plays' happen in the dark and your 'enemies' are often your own subconscious fears. You may feel a deep sense of 'powerlessness' that has no name, leading you to go on a spiritual 'deep dive' to find out who is really pulling the strings. You find your power when you shed your hidden guilt and your fear of the 'void,' becoming a master of the inner world. Survival Guide: Don't fight your 'shadow' in the dark; bring it into the light. Therapy and meditation are your weapons for total spiritual rebirth. Transformation is found in solitude, charity, and subconscious healing."
  },

  "Chiron": {
    "1": "With Chiron in the 1st House, the wound is tied to your very existence and the identity you present to the world. You may have felt invisible or not good enough as a child, leaving a lingering ache of self-doubt. However, as you work to heal yourself, you become an incredible guide for others, helping them find courage and self-love; as you heal others, your own identity begins to shine. Survival Guide: You must learn to give yourself the same infinite validation and love you offer others. Your perceived flaws are actually your greatest charisma and source of healing. Healing comes through authenticity and personal bravery.",
    "2": "Chiron in the 2nd House creates a deep sense of lack regarding self-worth and material security. No matter how much money or talent you possess, you might struggle with an inner fear of being worthless or having nothing. This wound makes you a genius at recognizing the value in others and managing resources; you become an expert at teaching people how to turn their talents into gold. Survival Guide: You must realize that material possessions do not define your value. You will find true security only when you trust your inner capabilities. Healing comes through developing abundance consciousness and practicing gratitude.",
    "3": "In the 3rd House, Chiron wounds your mind and communication. You may have felt misunderstood or made to feel unintelligent as a child, leading to a fear of making mistakes when speaking or writing. Yet, this sensitivity makes you a profound listener and a healer who mends souls with words. By helping others express themselves, you escape your own mental prison. Survival Guide: Believe in the power of your words. Every time you stay silent, you deprive the world of a specific healing frequency, so speak up even if you fear making a mistake. Healing comes through honest communication and constant learning.",
    "4": "Chiron in the 4th House represents a deep wound regarding home, family, and belonging. You might have felt like an outsider in your own family, or a hidden trauma in your roots may have shaken your basic sense of safety. This wound makes you a master at creating a sanctuary for others; you understand deep emotional pain and provide a compassionate harbor for those in need. Survival Guide: You must learn to parent your own inner child. Stop looking for a home on the outside and turn your own heart into the safest place you know. Healing comes through ancestral work and inner-child healing.",
    "5": "Here, Chiron targets your creativity and joy, making it feel as though having fun or standing in the spotlight is forbidden. The fear of being found inadequate in your artistic pursuits or love life can make you overly serious, but this makes you a magnificent mentor for others' inner artists. As you applaud others, your own creative spark begins to heal in the wings. Survival Guide: You don't need to be a perfect work of art; you just need to play. When you see fun as a right rather than a chore, your wound will close. Healing comes through art therapy and embracing playful energy.",
    "6": "In the 6th House, Chiron makes your body and daily work feel like a place of deficiency. You might struggle with chronic health issues or feel inefficient no matter how hard you work. This wound turns you into an expert in holistic health, nutrition, or organization; as you teach others how to be whole and healthy, you learn to truly listen to your own body. Survival Guide: Your body is a temple, not an enemy. Give up the obsession with a perfect routine and find beauty in your imperfect daily rhythms. Healing comes through alternative medicine and service-oriented work.",
    "7": "Chiron in the 7th House tests you through relationships. You might feel like you constantly attract wounded people or always end up as the one losing in a partnership. Your fear of abandonment is deep, yet this pain makes you a relationship expert or a gifted therapist. By healing the bonds of others, you discover your own strength in being whole while standing alone. Survival Guide: Do not wait for someone to save you, and do not try to be anyone’s savior. When you find your own completeness, you can build a truly healthy bond. Healing comes through a sense of justice and balanced partnerships.",
    "8": "With Chiron in the 8th House, the wound lies in the deepest realms of intimacy, power, and shared resources. You may have encountered a loss or a betrayal of power early on, making you very defensive. This wound makes you a soul surgeon who understands the darkest corners of human psychology; by helping others through crises, you make peace with your own shadows. Survival Guide: Let go of the need to control power and discover the healing found in surrender. When you face your deepest fears, you will find the treasure hidden within them. Healing comes through occult studies and deep psychological transformation.",
    "9": "In the 9th House, Chiron wounds your beliefs and your sense of meaning. You might have felt forgotten by the divine or that life is fundamentally meaningless. Academic or spiritual pursuits may have left you feeling empty, but this ache makes you a profound sage and guide for seekers. As you show others the meaning of life, you rebuild your own faith. Survival Guide: Stop searching for one absolute truth. Accept that life is a journey and every experience is a lesson. Healing comes through philosophy, travel, and high wisdom.",
    "10": "Chiron in the 10th House wounds you through career and status; no matter how successful you are, you fear appearing failing or inadequate in the public eye. You may have had issues with authority figures, but this turns you into an ethical and compassionate leader. By lighting the career paths of others, you heal your own sense of authority. Survival Guide: Look for success in your inner peace, not in external titles. You don't need the world to validate you; you need to validate yourself. Healing comes through social responsibility and honest leadership.",
    "11": "This placement makes you the outsider within social groups. You oscillate between a desperate desire to belong and a crushing fear of being cast out. You understand the marginalized better than anyone, which makes you a powerful activist or community leader. As you help others feel like they belong, your own wound of isolation heals. Survival Guide: You don't have to be part of the herd. Find the other weird and unique souls and build your own tribe. Healing comes through collective ideals and social reform.",
    "12": "With Chiron in the 12th House, the wound is hidden deep in the subconscious. You might suffer without knowing why, absorbing the collective pain of the world and feeling like a victim of fate. This wound brings immense intuition and spiritual depth; you become a silent healer who sees the pain others miss. Survival Guide: You cannot heal your wounds through total isolation. Use spiritual practices to transform this pain into universal love. Healing comes through meditation, retreat, and boundless compassion."
  },
  "Part of Fortune": {
    "1": "You are your own luck! You find happiness and abundance when you act independently, embrace your entrepreneurial spirit, and follow your own path without seeking approval. As you shine, the universe showers you with opportunities.",
    "2": "Your luck is in your hands and your tangible values. Producing, building, and creating a comfortable life brings you deep satisfaction and material wealth. As you value yourself, your treasury grows.",
    "3": "Fortune is found in your mind and your connections! Writing, learning, taking short trips, and sharing your ideas freely are your biggest gates to luck. Your curiosity leads you to gold.",
    "4": "Your treasure is buried in your home and your roots. Family bonds, a peaceful home environment, and emotional security are your lucky charms. The more peaceful your inner world, the more lasting your outer success.",
    "5": "You are here to create and have fun! Your luck is found on the stage, in art, in romance, and in your relationship with children. When you treat life as a game and take creative risks, the wheel of fortune spins in your favor.",
    "6": "You find happiness in an organized life and being useful to others. Mastering your craft, living healthily, and seeing perfection in small details brings both health and wealth. Building systems is your golden key.",
    "7": "Your luck comes through the other. Right partnerships, balanced relationships, and fair agreements open doors for you. When you move in harmony with others, your abundance multiplies.",
    "8": "Your treasure is hidden within the mysterious and deep. Managing others' resources, conducting deep research, and turning crises into opportunities brings you great power and luck. You thrive through transformation.",
    "9": "Your luck is found in the distance and in high ideas! Long travels, different cultures, academic success, and a broad worldview open your path. When you follow your beliefs, the universe supports you.",
    "10": "Your luck is waiting at the top! Public success, climbing the career ladder, and taking responsibility bring you prestige and great opportunities. Luck follows when you focus on your goals.",
    "11": "Happiness is hidden in your social circle and your dreams. Joining groups, participating in social projects, and keeping your hopes alive brings you fortune. Your friends are your greatest capital.",
    "12": "Your treasure is in the unseen world, your dreams, and spiritual work. Creative work done in solitude, meditation, and selfless help brings divine protection and luck. Listen to your inner voice; it leads the way."
  },
  "Regulus": {
    "Meaning": "The heart of the Lion. This royal star grants massive power, fame, and leadership in whatever house it occupies. However, Regulus has one strict condition: You must not take revenge! If you abuse your power or seek vengeance, Regulus will hurl you back down to where you started.",
    "1": "You are a born king or queen in personality and presence. You have natural authority and a striking physical aura. To succeed, you only need to be yourself, but if you succumb to pride and seek revenge on critics, you will lose your reputation overnight.",
    "2": "There is royal power in your finances and talents. You can achieve great wealth, and your ability to manage resources brings luxury. However, if you use money to crush others or as a tool for revenge, you risk losing all your assets.",
    "3": "With your words, you can build or destroy kingdoms. You gain great respect in communication and intellect. Your ideas can move masses. But if you use this power for gossip or to destroy rivals with words, your own reputation will crumble.",
    "4": "You are the absolute ruler of your household. You take great pride in your roots and home. However, if you seek revenge for past wounds through your family or loved ones, you will lose your emotional peace and your home.",
    "5": "Royal splendor follows you in creativity and love! You can reach the top in your art or romantic life. But if you use love as a power game to satisfy your ego, your creative energy will dry up.",
    "6": "You can be an unrivaled master and leader in your field of work. The service you provide brings great respect. But if you resort to intrigue for revenge against workplace rivals, your health and job will slip away.",
    "7": "You experience royal power through relationships and partnerships. You may have very powerful partners or a noble spouse. But if you become unjust and seek revenge, you will lose your prestige in legal battles.",
    "8": "You have massive power over others' resources and shared money. You are a leader in crisis management. But if you enter hidden power plays or use weaknesses for revenge, you will experience the greatest downfall yourself.",
    "9": "You can be a great authority in academia, law, or religion. You become a recognized name in distant lands. But if you use high knowledge to belittle others or for ideological revenge, your respect will be stripped away.",
    "10": "In the public eye, you are an emperor at the peak of your career! You can reach the highest offices. But the rule is clear: Do not look down on anyone and do not take revenge. If you do, the fall will be hard and very public.",
    "11": "You are like a lion within social circles and ideals. You are the natural leader of groups, and your dreams can change the world. But if you manipulate or exclude others to take revenge, your most trusted friends will abandon you.",
    "12": "Your power is hidden! You might be ruling a kingdom behind the scenes. Your spirituality and dreams grant you royal wisdom. But if you use this spiritual power to harm others or seek dark revenge, your peace of mind will face a heavy trial."
  },

  "Juno": {
    "1": "With Juno in the 1st House, your partner is a literal reflection of you. You might meet 'The One' while you are out doing something solo—like at a gym, a solo coffee run, or a self-improvement workshop. They are drawn to your vibe and your independence. This partner likely puts you on a pedestal, and you are often seen as a 'Power Individual' before you become a power couple. Predictions: You might meet while you are focused entirely on your own goals, perhaps at a branding event or just walking down the street looking your best.",
    "2": "Your Juno is in the house of values and money, meaning your partner brings a sense of stability that feels like a warm blanket. You might meet them in a financial setting, like a bank, a luxury boutique, or while discussing a business deal. They likely have their life together and appreciate the finer things. Predictions: Look for your spouse at a gourmet cooking class, a high-end auction, or through a shared interest in investments and property.",
    "3": "For you, the spark starts with a conversation. With Juno in the 3rd, your spouse is likely someone you communicate with daily—perhaps a neighbor, a former classmate, or someone you met on a short commute. You need a partner who is witty and keeps your brain buzzing. Predictions: You might meet your partner on a short domestic flight, at a local bookstore, in a neighborhood cafe, or even through a spicy debate in a group chat.",
    "4": "Juno in the 4th House suggests a 'Homecoming' kind of love. You are likely to meet your spouse through family connections or while you are in a very private, safe setting. They might even be someone from your childhood or someone who lives just a few blocks away. Predictions: You could meet at a family wedding, a housewarming party, or while you are looking at real estate. Your partner is the one who makes you feel safe enough to take your armor off.",
    "5": "This is the most theatrical placement for Juno. You are likely to meet your spouse in a place of pure joy—a music festival, a nightclub, a theater, or a sports game. The meeting will feel like a scene from a romantic comedy. Predictions: Keep an eye out at a creative workshop, a high-energy party, or even while pursuing a hobby like painting or dancing. Your spouse is someone who knows how to keep the spark alive forever.",
    "6": "Juno in the 6th House means your love life is deeply intertwined with your 'Daily Grind.' You are most likely to meet your spouse in a professional setting, at your job, or through your professional network. You might even meet them at the gym or the vet! Predictions: Your 'The One' is likely a colleague, a client, or someone you meet while volunteering or working on a project. They are the person who notices how hard you work and wants to help you carry the load.",
    "7": "Juno is at home here, meaning your spouse is the ultimate 'Other Half.' You might meet them in a traditional way, perhaps through a formal introduction or at a wedding. This is a very 'public' meeting, and your relationship will be highly visible. Predictions: You could meet your partner through a legal setting, a formal event, or even as a direct competitor who eventually becomes your greatest ally.",
    "8": "This is a 'Ride or Die' placement. You meet your spouse in the middle of a transformation or a crisis. It’s deep, intense, and maybe a little bit taboo. You might meet them at a psychology seminar, a funeral, or while dealing with shared finances. Predictions: Look for them in places of deep research, occult studies, or during a time of major life change. They are the one who stays when everyone else leaves.",
    "9": "Your Juno is an explorer. You are destined to meet your spouse far away from home, either in a foreign country, on a long-distance trip, or in an academic setting like a university. You might marry a foreigner. They might have a totally different background or culture than you. Predictions: You might meet your spouse while studying for your master's degree, at a religious or philosophical gathering, or on a solo backpacking trip across Europe.",
    "10": "Your spouse is someone of high status or someone you meet while you are both climbing the career ladder. You might meet them at a big corporate event, an awards ceremony, or while you are in a position of authority. Predictions: You could meet your partner while giving a speech, attending a high-level networking gala, or being featured in the news. Your marriage will be a professional power-play.",
    "11": "Juno in the 11th House means your spouse starts as your best friend or a member of your 'tribe.' You are likely to meet them through a social movement, a political group, or an online community. Predictions: You might meet at a protest, a tech convention, or through a mutual friend who insists you two are perfect for each other. Your spouse is someone who shares your vision for the future.",
    "12": "This is a 'Soulmate' placement that feels like destiny. You might meet your spouse in a place of retreat—a hospital, a meditation center, a library, or even in a dream before you meet in real hay. Predictions: The meeting might be quiet and private, perhaps at a yoga retreat, a charity event, or through a spiritual community. It’s the kind of meeting where you feel like you’ve known them for a thousand years."
  }
}